Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: Normally the same thing will be drawn on each canvas, but that can be changed if a [[Shader|pixel shader]] is used with the [[love.graphics.newShader#Pixel_Shader_Function| effects function]] instead of the regular effect .
pt_br: Normalmente, a mesma coisa será desenhada em cada tela, mas isso pode ser mudado se um [[Shader (Português)|shader de pixel]] for usado com a [[love.graphics.newShader#Fun.C3.A7.C3.A3o_do_Shader_de_Pixel| função effects ]], em vez do effect comum.

source: The texture (Image or Canvas) to use.
pt_br: A textura (Imagem ou Pintura) a ser usada.

source: Sets whether wireframe lines will be used when drawing.
pt_br: Configura se o modo de estrutura de arame será usado ou não ao desenhar.

source: Shearing factor (y-axis).
pt_br: Fator de inclinação (eixo y).

source: font = love.graphics.setNewFont( file, size )
pt_br: fonte = love.graphics.setNewFont( arquivo, tamanho )

source: Scale factor (x-axis).
pt_br: Fator de escala (eixo x).

source: copyAlpha (false)
pt_br: copiarAlfa (false)

source: font = love.graphics.newImageFont( imageData, glyphs )
pt_br: fonte = love.graphics.newImageFont( dadoDeImagem, glifos )

source: The [[Image]] or [[Canvas]] to use for the sprites.
pt_br: A [[Image (Português)|Imagem]] ou [[Canvas (Português)|Pintura]] a ser usada nos sprites.

source: Drawing a circle with a hole
pt_br: Desenhar um círculo com um buraco

source: The new font.
pt_br: A nova fonte.

source: Coordinates of the pixel relative to the texture. The y-axis of canvases are inverted. Coordinates (1,1) would be the top right corner of the canvas.
pt_br: Coordenadas do pixel em relação à textura. O eixo y das pinturas é invertido. Coordenadas (1,1) seriam o canto superior direito da pintura.

source: Creates a new [[ParticleSystem]].
pt_br: Cria um novo [[ParticleSystem (Português)|SistemaDePartículas]].

source: Lua functions can be used directly with [[love.graphics.setStencil]]
pt_br: Funções em Lua podem ser usadas diretamente com [[love.graphics.setStencil (Português)|love.graphics.setStencil]]

source: Sets the current pixel shader to a specified [[PixelEffect]].
pt_br: Configura o [[PixelEffect (Português)|EfeitoDePixel]] especificado como o shader de pixel atual.

source: Writing to multiple lines : In Windows, some text editors (e.g. Notepad) only treat CRLF ("\r\n") as a new line.
pt_br: Escrevendo em linhas múltiplas : No Windows, alguns editores de texto (por exemplo, Notepad) tratam apenas CRLF ("\r\n") como nova linha.

source: This is the only directory where love.filesystem can write files.
pt_br: Esse é o único diretório onde o love.filesystem pode salvar arquivos.

source: The X velocity of the listener.
pt_br: A velocidade em X do ouvinte.

source: The new identity that will be used as write directory
pt_br: A nova identidade que irá ser usada como diretório de escrita.

source: Creates a new [[Quad]].
pt_br: Cria um novo [[Quad (Português)|Quad]].

source: love.graphics.printf("This text is aligned center",100, 100, 200,"center") -- center your text around x = 200/2 + 100 = 200 love.graphics.printf("This text is aligned right",100, 100, 200,"right") -- align right to x = 100 + 200 = 300
pt_br: love.graphics.printf("Este texto está centralizado",100, 100, 200,"center") -- centraliza seu texto ao redor de x = 200/2 + 100 = 200 love.graphics.printf("Este texto está alinhado à direita",100, 100, 200,"right") -- alinha à direita até x = 100 + 200 = 300

source: The error message on failure.
pt_br: A mensagem de erro em caso de falha.

source: * [[love.graphics.setBlendMode]]
pt_br: * [[love.graphics.setBlendMode (Português)|love.graphics.setBlendMode]]

source: The blend mode to use.
pt_br: O modo de mistura a ser utilizado.

source: The pixel shader code, or a filename pointing to a file with the code.
pt_br: O código do shader de pixel, ou um nome de arquivo apontando para um arquivo com o código.

source: pacwidth = math.pi / 6 -- size of his mouth function love.draw( ) love.graphics.setColor( 255, 255, 0 ) -- pacman needs to be yellow love.graphics.arc( "fill", 400, 300, 100, pacwidth, (math.pi * 2) - pacwidth ) end
pt_br: paclargura = math.pi / 6 -- tamanho da boca dele function love.draw( ) love.graphics.setColor( 255, 255, 0 ) -- o pacman tem que ser amarelo love.graphics.arc( "fill", 400, 300, 100, paclargura, (math.pi * 2) - paclargura ) end

source: Sets the position of the listener.
pt_br: Define a posição do ouvinte.

source: limit = love.graphics.getSystemLimit( limittype )
pt_br: limite = love.graphics.getSystemLimit( tipodelimite )

source: Creates a new [[Mesh]].
pt_br: Cria uma nova [[Mesh (Português)|Malha]].

source: True if the archive was successfully unmounted, false otherwise.
pt_br: Verdadeiro se o arquivo tiver sido desmontado com sucesso, senão, falso.

source: * [[love.graphics.setBackgroundColor]]
pt_br: * [[love.graphics.setBackgroundColor (Português)|love.graphics.setBackgroundColor]]

source: * [[love.math.isConvex]]
pt_br: * [[love.math.isConvex (Português)|love.math.isConvex]]

source: Gets the current working directory.
pt_br: Obtém o diretório de trabalho atual.

source: These directories will typically be found in something like:
pt_br: Esses diretórios normalmente podem ser encontrados em algo como:

source: format
pt_br: formato

source: Draws text on screen.
pt_br: Desenha texto na tela.

source: * [[Shader Variables]]
pt_br: * [[Shader Variables (Português)|Variáveis de Shader]]

source: See Also
pt_br: Veja Também

source: File
pt_br: Arquivo

source: The FontData.
pt_br: O DadoDeFonte.

source: The position of first point on the y-axis.
pt_br: A posição do primeiro ponto no eixo y.

source: Files that are opened for read will be looked for in the save directory, and then in the .love archive (in that order).
pt_br: Arquivos abertos para leitura serão procurados no diretório de escrita e depois no arquivo .love (nessa ordem).

source: ColorMode
pt_br: ModoDeCor

source: It has been renamed to [[love.graphics.setCanvas]]
pt_br: Foi renomeado para [[love.graphics.setCanvas (Português)|love.graphics.setCanvas]]

source: Clears the screen to background color.
pt_br: Limpa a tela para cor de fundo.

source: Display a Venn diagram
pt_br: Mostra um diagrama de Venn

source: The pixel grid is actually offset to the center of each pixel.
pt_br: A grade de pixel é na verdade deslocada para o centro de cada pixel.

source: Scaling by zero is not a useful operation.
pt_br: Redimensionar por zero não é uma operação útil.

source: This is done either with [[love.filesystem.setIdentity]] or by setting the identity field in [[love.conf]].
pt_br: Isso é feito ou com [[love.filesystem.setIdentity (Português)|love.filesystem.setIdentity]] ou definindo o campo identity (identidade) em [[love.conf (Português)|love.conf]].

source: The position on the x-axis.
pt_br: A posição no eixo x.

source: source
pt_br: fonte

source: All drawing operations until the next love.graphics.setRenderTarget will be directed to the [[Framebuffer]] object specified.
pt_br: Todas operações de desenho até o próximo love.graphics.setRenderTarget serão direcionadas para o objeto [[Framebuffer (Português)|Framebuffer]] especificado.

source: for e, a, b, c, d in love.event.poll() do if e == "quit" then -- Quit! end end
pt_br: for e, a, b, c, d in love.event.poll() do if e == "quit" then -- Sair! end end

source: love.graphics.setFont( font )
pt_br: love.graphics.setFont( fonte )

source: The graphics feature to get the maximum value of.
pt_br: O recurso gráfico cujo valor máximo se busca.

source: The Decoder to create a Source from.
pt_br: O Decodificador a partir do qual se deve criar uma Fonte.

source: Disables scissor.
pt_br: Desativa recorte.

source: * [[love.graphics.isWireframe]]
pt_br: * [[love.graphics.isWireframe (Português)|love.graphics.isWireframe]]

source: A drawable object.
pt_br: Um objeto desenhável.

source: Following the mode argument, this function can accept multiple numeric arguments or a single table of numeric arguments.
pt_br: Após o argumento modo, esta função pode aceitar múltiplos argumentos numéricos ou uma única tabela de argumentos numéricos.

source: Since the rotation is always around the origin, translating the center of the screen to the origin and back around the rotate operation makes the effective rotation point be the center of the screen.
pt_br: Como a rotação é sempre em torno da origem, transladar o centro da tela para a origem, fazer a operação de rotação e transladar a tela de volta à posição original faz com que o ponto de rotação efetivo seja o centro da tela.

source: Streaming or static source.
pt_br: Fonte em fluxo ou estática.

source: * [[love.graphics.getBlendMode]]
pt_br: * [[love.graphics.getBlendMode (Português)|love.graphics.getBlendMode]]

source: Data
pt_br: Dado

source: height of clipping rectangle.
pt_br: A altura do retângulo.

source: The amount of red.
pt_br: A quantidade de vermelho.

source: function love.draw() love.graphics.line(200,50, 400,50, 500,300, 100,300, 200,50) -- last pair is a repeat to complete the trapezoid end
pt_br: function love.draw() love.graphics.line(200,50, 400,50, 500,300, 100,300, 200,50) -- o último par é repetido para fechar o trapézio end

source: The first render target.
pt_br: O primeiro alvo de renderização.

source: * [[love.graphics.rotate]]
pt_br: * [[love.graphics.rotate (Português)|love.graphics.rotate]]

source: The current color mode.
pt_br: O modo de cor atual.

source: width of clipping rectangle.
pt_br: A largura do retângulo.

source: This example shows how to give the coordinates explicitly and how to pass a table argument.
pt_br: Este exemplo mostra como dar explicitamente as coordenadas e como passar uma tabela como argumento.

source: All drawing operations until the next love.graphics.setPixelEffect will be drawn using the [[PixelEffect]] object specified.
pt_br: Todas operações de desenho até a próxima chamada de love.graphics.setPixelEffect serão desenhadas usando o objeto [[PixelEffect (Português)|EfeitoDePixel]] especificado.

source: Effect Function
pt_br: Função Effect

source: name
pt_br: nome

source: Sets the background color.
pt_br: Configura a cor de fundo.

source: The image data containing the drawable pictures of font glyphs.
pt_br: O dado de imagem contendo imagens desenháves dos glifos de uma fonte.

source: canvas = love.graphics.newCanvas( width, height )
pt_br: pintura = love.graphics.newCanvas( largura, altura )

source: pixeleffect
pt_br: efeitodepixel

source: pattern, repeat = love.graphics.getLineStipple( )
pt_br: padrao, repeticao = love.graphics.getLineStipple( )

source: The position of the center along x-axis.
pt_br: A posição do centro ao longo do eixo x.

source: font = love.graphics.setNewFont( data, size )
pt_br: fonte = love.graphics.setNewFont( dado, tamanho )

source: Rotating a static scene
pt_br: Rotacionar uma cena estática

source: The repeat factor.
pt_br: O fator de repetição.

source: How many bytes to read
pt_br: Quantidade de bytes a ler

source: Doing the same for a canvas will result in an error.
pt_br: Fazer o mesmo em uma pintura resultará em erro.

source: The new target.
pt_br: O novo alvo.

source: x coordinate of upper left corner.
pt_br: A coordenada x do canto superior esquerdo.

source: The encoded data to decode into image data.
pt_br: O dado codificado a ser decodificado num dado de imagem.

source: function love.graphics.load() love.graphics.setFont(love.graphics.newFont(18)) end function love.draw() love.graphics.print("Hello", 300, 300) end
pt_br: function love.graphics.load() love.graphics.setFont(love.graphics.newFont(18)) end function love.draw() love.graphics.print("Olá", 300, 300) end

source: * [[love.graphics.clear]]
pt_br: * [[love.graphics.clear (Português)|love.graphics.clear]]

source: Sets the master volume.
pt_br: Define o volume mestre.

source: Window
pt_br: Janela

source: Checks if certain graphics functions can be used.
pt_br: Verifica se certas funções gráficas podem ser usadas.

source: Rotates the coordinate system in two dimensions.
pt_br: Rotaciona o sistema de coordenadas em duas dimensões.

source: Returns the orientation of the listener.
pt_br: Retorna a orientação do ouvinte.

source: The Data object to append to the file.
pt_br: O objeto Dado a ser acrescentado ao arquivo.

source: angle1
pt_br: angulo1

source: data
pt_br: dado

source: limit
pt_br: limite

source: local angle = 0 function love.draw() local width = love.graphics.getWidth() local height = love.graphics.getHeight() -- rotate around the center of the screen by angle radians love.graphics.translate(width/2, height/2) love.graphics.rotate(angle) love.graphics.translate(-width/2, -height/2) -- draw a white rectangle slightly off center love.graphics.setColor(0xff, 0xff, 0xff) love.graphics.rectangle('fill', width/2-100, height/2-100, 300, 400) -- draw a five-pixel-wide blue point at the center love.graphics.setPointSize(5) love.graphics.setColor(0, 0, 0xff) love.graphics.point(width/2, height/2) end function love.update(dt) love.timer.sleep(.01) angle = angle + dt * math.pi/2 angle = angle % (2*math.pi) end
pt_br: local angulo = 0 function love.draw() local largura = love.graphics.getWidth() local altura = love.graphics.getHeight() -- rotaciona ao redor do centro de tela na medida do ângulo em radianos love.graphics.translate(largura/2, altura/2) love.graphics.rotate(angulo) love.graphics.translate(-largura/2, -altura/2) -- desenha um retângulo branco ligeiramente fora do centro love.graphics.setColor(0xff, 0xff, 0xff) love.graphics.rectangle('fill', largura/2-100, altura/2-100, 300, 400) -- desenha um ponto azul de 5 pixels de tamanho no centro love.graphics.setPointSize(5) love.graphics.setColor(0, 0, 0xff) love.graphics.point(largura/2, altura/2) end function love.update(dt) love.timer.sleep(.01) angulo = angulo + dt * math.pi/2 angulo = angulo % (2*math.pi) end

source: Creates a new stencil.
pt_br: Cria um novo estêncil.

source: Whether the alpha color component is active when rendering.
pt_br: Se o componente de cor alfa é ativo ou não ao renderizar.

source: The max number of sprites.
pt_br: O número máximo de sprites.

source: The path and name of the file with the font.
pt_br: O caminho e nome do arquivo contendo a fonte.

source: Translating using whole numbers will prevent tearing/blurring of images and fonts draw after translating.
pt_br: Transladar usando números inteiros evitará a distorção de imagens e fontes desenhadas depois da translação.

source: Creates a new Shader object for hardware-accelerated vertex and pixel effects.
pt_br: Cria um novo objeto Shader para efeitos de vértice e de pixel com aceleração de hardware.

source: Creates a new [[Font]] by loading a specifically formatted image.
pt_br: Cria uma nova [[Font (Português)|Fonte]] carregando uma imagem formatada.

source: local highscores = {} for line in love.filesystem.lines("highscores.lst") do table.insert(highscores, line) end
pt_br: local pontuacoes = {} for linha in love.filesystem.lines("pontuações.lst") do table.insert(pontuacoes, linha) end

source: errormsg
pt_br: msgerro

source: * [[love.graphics.scale]]
pt_br: * [[love.graphics.scale (Português)|love.graphics.scale]]

source: Returns the default scaling filters used with [[Image]]s, [[Canvas]]es, and [[Font]]s.
pt_br: Retorna os filtros de redimensionamento padrão usados com [[Image (Português)|Imagens]], [[Canvas (Português)|Pinturas]] e [[Font (Português)|Fontes]].

source: Sets the blending mode.
pt_br: Configura modo de mistura.

source: Error smoothly if the graphics card does not support canvases
pt_br: Mensagem de erro suave caso a placa de vídeo não suporte pinturas

source: Creates a new [[Framebuffer]].
pt_br: Cria um novo [[Framebuffer (Português)|Framebuffer]].

source: The Z velocity of the listener.
pt_br: A velocidade em Z do ouvinte.

source: This can be useful if you want to use the standard io library (or something else) to
pt_br: Isso pode ser útil se você deseja utilizar a biblioteca de io padrão (ou alguma outra coisa) para

source: The SoundData to create a Source from.
pt_br: O DadoDeSom a partir do qual se deve criar uma Fonte.

source: The path of the user's directory
pt_br: O caminho do diretório do usuário

source: It is important to note that love.filesystem.load does not invoke the code, it just creates a function (a 'chunk') that will contain the contents of the file inside it.
pt_br: É importante notar que love.filesystem.load não invoca o código, somente cria uma função (um "bloco") que contém o conteúdo do arquivo.

source: The amount of alpha. The alpha value will be applied to all subsequent draw operations, even the drawing of an image.
pt_br: A quantidade de alfa. O valor alfa será aplicado a todas operações de desenho subsequentes, até mesmo o desenho de uma imagem.

source: It also sets both the point and line drawing modes to smooth and their sizes to 1.0 .
pt_br: Também configura ambos modos de desenho de ponto e de linha como smooth (suave) e seus tamanhos como 1.0 .

source: Gets the current scissor box.
pt_br: Obtém a área de recorte atual.

source: Antialiased Canvases have *slightly* higher system requirements than normal Canvases.
pt_br: Pinturas antisserrilhadas exigem *um pouco* mais do sistema que Pinturas normais.

source: * [[love.graphics.getColorMask]]
pt_br: * [[love.graphics.getColorMask (Português)|love.graphics.getColorMask]]

source: The arc is drawn counter clockwise if the starting angle is numerically bigger than the final angle.
pt_br: Se o ângulo inicial for numericamente maior que o ângulo final, o arco é desenhado em sentido anti-horário.

source: love.graphics.shear( kx, ky )
pt_br: love.graphics.shear( ix, iy )

source: texture
pt_br: textura

source: Sets the line stipple pattern.
pt_br: Configura o padrão de pontilhado da linha.

source: Draws objects on screen.
pt_br: Desenha objetos na tela.

source: Effect language
pt_br: Linguagem de efeitos

source: function love.load() image = love.graphics.newImage("pig.png") local vertices = { { -- top-left corner (red-tinted) 0, 0, -- position of the vertex 0, 0, -- texture coordinate at the vertex position 255, 0, 0, -- color of the vertex }, { -- top-right corner (green-tinted) image:getWidth(), 0, 1, 0, -- texture coordinates are in the range of [0, 1] 0, 255, 0 }, { -- bottom-right corner (blue-tinted) image:getWidth(), image:getHeight(), 1, 1, 0, 0, 255 }, { -- bottom-left corner (yellow-tinted) 0, image:getHeight(), 0, 1, 255, 255, 0 }, } -- the Mesh DrawMode "fan" works well for 4-vertex Meshes. mesh = love.graphics.newMesh(vertices, image, "fan") end function love.draw() love.graphics.draw(mesh, 0, 0) end
pt_br: function love.load() imagem = love.graphics.newImage("pig.png") local vertices = { { -- canto superior esquerdo (avermelhado) 0, 0, -- posição do vértice 0, 0, -- coordenada de textura na posição do vértice 255, 0, 0, -- cor do vértice }, { -- canto superior direito (esverdeado) image:getWidth(), 0, 1, 0, -- coordenadas de textura estão entre 0 e 1 0, 255, 0 }, { -- canto inferior direito (azulado) image:getWidth(), image:getHeight(), 1, 1, 0, 0, 255 }, { -- canto inferior esquerdo (amarelado) 0, image:getHeight(), 0, 1, 255, 255, 0 }, } -- o ModoDeDesenho de Malha "fan" (leque) funciona bem com Malhas de 4 vértices. malha = love.graphics.newMesh(vertices, imagem, "fan") end function love.draw() love.graphics.draw(malha, 0, 0) end

source: Sets the line width and style.
pt_br: Configura a espessura e o estilo da linha.

source: number
pt_br: número

source: All drawing operations until the next love.graphics.setShader will be drawn using the [[Shader]] object specified.
pt_br: Todas operações de desenho até o próximo love.graphics.setShader serão desenhadas usando o objeto [[Shader (Português)|Shader]] especificado.

source: canvas2
pt_br: pintura2

source: Synopsis
pt_br: Sinopse

source: output_color
pt_br: cor_de_saida

source: The pixelcode and vertexcode arguments can be in any order.
pt_br: Os argumentos codigodepixel e codigodevertice podem estar em qualquer ordem.

source: A game is in fused mode if the source .love has been fused to the executable (see [[Game Distribution]]), or if "--fused" has been given as a command-line argument when starting the game.
pt_br: Um jogo está em modo fundido se a fonte .love tiver sido fundida com o executável (veja [[Game Distribution (Português)|Distribuição de Jogos]]), ou se "--fused" tiver sido usado como argumento de linha de comando ao iniciar o jogo.

source: Simply remove all files and folders in the directory beforehand.
pt_br: Simplesmente remova todos arquivos e pastas do diretório primeiro.

source: For example if three 1s are consecutively placed they are stretched to six if the repeat is 2.
pt_br: Por exemplo, se três dígitos 1 são colocados consecutivamente, eles são esticados até seis se a repeticao é 2.

source: You can set it with [[love.filesystem.setIdentity]]() as well.
pt_br: Você também pode defini-la com [[love.filesystem.setIdentity (Português)|love.filesystem.setIdentity]]() .

source: The path to a potential file or directory.
pt_br: O caminho do possível arquivo ou diretório.

source: If no [[Font]] is set, one will be created and set (once) if needed.
pt_br: Se nenhuma [[Font (Português)|Fonte]] estiver configurada, uma irá ser criada e configurada (uma vez) se necessário.

source: numSources = love.audio.getNumSources( )
pt_br: numFontes = love.audio.getNumSources( )

source: framebuffer = love.graphics.newFramebuffer( width, height )
pt_br: framebuffer = love.graphics.newCanvas( largura, altura )

source: WAV files are always loaded as stereo, OGG works fine.
pt_br: Arquivos WAV são sempre carregados como estéreo, OGG funciona bem.

source: Set the point size to the maximum supported size.
pt_br: Definir o tamanho de ponto como o tamanho máximo suportado.

source: * [[ love.graphics.setInvertedStencil]]
pt_br: * [[ love.graphics.setInvertedStencil (Português)|love.graphics.setInvertedStencil]]

source: function love.load() filesString = recursiveEnumerate("", "") end -- This function will return a string filetree of all files -- in the folder and files in all subfolders function recursiveEnumerate(folder, fileTree) local lfs = love.filesystem local filesTable = lfs.enumerate(folder) for i,v in ipairs(filesTable) do local file = folder.."/"..v if lfs.isFile(file) then fileTree = fileTree.."\n"..file elseif lfs.isDirectory(file) then fileTree = fileTree.."\n"..file.." (DIR)" fileTree = recursiveEnumerate(file, fileTree) end end return fileTree end function love.draw() love.graphics.print(filesString, 0, 0) end
pt_br: function love.load() stringDeArquivos = enumerarRecursivamente("", "") end -- Esta função irá retornar um string contendo uma -- árvore de arquivos com todos arquivos na pasta e -- arquivos em todas subpastas function enumerarRecursivamente(pasta, arvoreDeArquivos) local lfs = love.filesystem local tabelaDeArquivos = lfs.enumerate(pasta) for i,v in ipairs(tabelaDeArquivos) do local arquivo = pasta.."/"..v if lfs.isFile(arquivo) then arvoreDeArquivos = arvoreDeArquivos.."\n"..arquivo elseif lfs.isDirectory(arquivo) then arvoreDeArquivos = arvoreDeArquivos.."\n"..arquivo.." (DIR)" arvoreDeArquivos = enumerarRecursivamente(arquivo, arvoreDeArquivos) end end return arvoreDeArquivos end function love.draw() love.graphics.print(stringDeArquivos, 0, 0) end

source: read or write in the save directory.
pt_br: ler ou escrever no diretório de escrita.

source: * [[love.graphics.point]]
pt_br: * [[love.graphics.point (Português)|love.graphics.point]]

source: Draw a red, blue and green circle
pt_br: Desenha um círculo vermelho, um azul e um verde

source: The position of the top left corner along x-axis.
pt_br: A posição do canto superior esquerdo no eixo x.
